renesas/ArduinoCore-rl78g22_fpb/variants/g22-fpb-48p/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/
/*
 * Modified 13 July 2014 by Nozomu Fujita
 * Modified  2 Mar  2017 by Yuuki Okamiya
 * Modified 21 Oct. 2022 by Yoshikazu Aono (KAD)
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>
#include <stdlib.h>

#define NUM_DIGITAL_PINS            44
// 2022/11/15 modified by KAD available pins :3 (A0, A1, A7) but include 5 dummies (A2-A6)
#define NUM_ANALOG_INPUTS           8
#define NUM_SWPWM_PINS              4
// 2022/10/21 not completd
#define analogInputToDigitalPin(p)  ((p < 6) ? (p) + 14 : -1)

#define digitalPinHasPWM(p)         ((p) == 3 || (p) == 5 || (p) == 6 || (p) == 9 || (p) == 10 || (p) == 11)

// #ifdef __RL78__
#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (36)
#define PIN_SPI_MISO  (37)
#define PIN_SPI_SCK   (38)

#define PIN_SPI3_SS    (27)
#define PIN_SPI3_MOSI  (11)
#define PIN_SPI3_MISO  (12)
#define PIN_SPI3_SCK   (13)

#define PIN_SPI4_SS    (27)
#define PIN_SPI4_MOSI  (35)
#define PIN_SPI4_MISO  (34)
#define PIN_SPI4_SCK   (33)

#define PIN_SPI5_SS    (27)
#define PIN_SPI5_MOSI  (21)
#define PIN_SPI5_MISO  (20)
#define PIN_SPI5_SCK   (19)

static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

static const uint8_t SS3   = PIN_SPI3_SS;
static const uint8_t MOSI3 = PIN_SPI3_MOSI;
static const uint8_t MISO3 = PIN_SPI3_MISO;
static const uint8_t SCK3  = PIN_SPI3_SCK;

static const uint8_t SS4   = PIN_SPI4_SS;
static const uint8_t MOSI4 = PIN_SPI4_MOSI;
static const uint8_t MISO4 = PIN_SPI4_MISO;
static const uint8_t SCK4  = PIN_SPI4_SCK;

static const uint8_t SS5   = PIN_SPI5_SS;
static const uint8_t MOSI5 = PIN_SPI5_MOSI;
static const uint8_t MISO5 = PIN_SPI5_MISO;
static const uint8_t SCK5  = PIN_SPI5_SCK;

#define PIN_WIRE_SDA0        (48) // P61
#define PIN_WIRE_SCL0        (47) // P60
#define PIN_WIRE_SDA1        (50) // P63
#define PIN_WIRE_SCL1        (49) // P62

#define PIN_WIRE_SDA0_MASK   0x02 // P61
#define PIN_WIRE_SCL0_MASK   0x01 // P60
#define PIN_WIRE_SDA1_MASK   0x08 // P63
#define PIN_WIRE_SCL1_MASK   0x04 // P62

static const uint8_t SDA0 = PIN_WIRE_SDA0;
static const uint8_t SCL0 = PIN_WIRE_SCL0;
static const uint8_t SDA1 = PIN_WIRE_SDA1;
static const uint8_t SCL1 = PIN_WIRE_SCL1;

#define BUILTIN_LED1 14
#define BUILTIN_LED2 15

#define LED_BUILTIN BUILTIN_LED1

// 2022/10/21 added for Firmata
#define LED_ON  LOW
#define LED_OFF HIGH

#define PIN_A0   (38)	/*A0 = ANI18 */
#define PIN_A1   (39)	/*A1 = ANI7 */
#define PIN_A2   (40)	/*A2 = ANI6 */
#define PIN_A3   (41)	/*A3 = ANI5 */
#define PIN_A4   (42)	/*A4 = ANI4 */
#define PIN_A5   (43)	/*A5 = ANI3 */
#define PIN_A6	(26)	/* ANI16 */
#define PIN_A7	(4)	/* ANI19 */

static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
static const uint8_t A3 = PIN_A3;
static const uint8_t A4 = PIN_A4;
static const uint8_t A5 = PIN_A5;
static const uint8_t A6 = PIN_A6;
static const uint8_t A7 = PIN_A7;

#define digitalPinToPCICR(p)    (((p) >= 0 && (p) <= 21) ? (&PCICR) : ((uint8_t *)0))
#define digitalPinToPCICRbit(p) (((p) <= 7) ? 2 : (((p) <= 13) ? 0 : 1))
#define digitalPinToPCMSK(p)    (((p) <= 7) ? (&PCMSK2) : (((p) <= 13) ? (&PCMSK0) : (((p) <= 21) ? (&PCMSK1) : ((uint8_t *)0))))
#define digitalPinToPCMSKbit(p) (((p) <= 7) ? (p) : (((p) <= 13) ? ((p) - 8) : ((p) - 14)))

#define digitalPinToInterrupt(p)  (((p) == 32) ? 0 : (((p) == 22) ? 1 : (((p) == 23) ? 2 : (((p) == 8) ? 3 : (((p) == 3) ? 4 : (((p) == 10) ? 5 : (((p) == 2) ? 6 : NOT_AN_INTERRUPT)))))))

/***************************************************************************/
/*    Macro Definitions                                                    */
/***************************************************************************/
#define ADDR_PORT_REG			0xFFFFFF00
#define ADDR_PORT_MODE_REG		0xFFFFFF20
#define ADDR_PORT_PULL_UP_REG	0xFFFF0030
#define	ADDR_PORT_IN_MODE_REG	0xFFFF0040
#define ADDR_PORT_OUT_MODE_REG	0xFFFF0050
#define ADDR_PORT_MODE_CONTROL_A_REG	0xFFFF0060
#define ADDR_PORT_MODE_CONTROL_T_REG	0xFFFF0260

// 2022/11/14 modified by KAD
#define ANALOG_PIN_0		18		// ANI18 (DIGITAL_PIN_38)
#define ANALOG_PIN_1		7		// ANI7 (DIGITAL_PIN_39)
#define ANALOG_PIN_2		6		// ANI6 (DIGITAL_PIN_40)
#define ANALOG_PIN_3		5		// ANI5 (DIGITAL_PIN_41)
#define ANALOG_PIN_4		4		// ANI4 (DIGITAL_PIN_42)
#define ANALOG_PIN_5		3		// ANI3 (DIGITAL_PIN_43)
#define ANALOG_PIN_6		2		// ANI2 (DIGITAL_PIN_22)
#define ANALOG_PIN_7		19		// ANI19 (DIGITAL_PIN_120)

/* Port define. */
#define PORT_0				0
#define PORT_1				1
#define PORT_2				2
#define PORT_3				3
#define PORT_4				4
#define PORT_5				5
#define PORT_6				6
#define PORT_7				7
#define PORT_8				8
#define PORT_9				9
#define PORT_10				10
#define PORT_11				11
#define PORT_12				12
#define PORT_13				13
#define PORT_14				14
#define PORT_15				15

/* Port of digital pin define. */
#define DIGITAL_PIN_0		PORT_0	/* P01	*/
#define DIGITAL_PIN_1		PORT_0	/* P00	*/
#define DIGITAL_PIN_2		PORT_14	/* P140	*/
#define DIGITAL_PIN_3		PORT_3	/* P31	*/
#define DIGITAL_PIN_4		PORT_12	/* P120	*/
#define DIGITAL_PIN_5		PORT_4	/* P41	*/
#define DIGITAL_PIN_6		PORT_1	/* P10	*/
#define DIGITAL_PIN_7		PORT_14	/* P146	*/
#define DIGITAL_PIN_8		PORT_3	/* P30	*/
#define DIGITAL_PIN_9		PORT_1	/* P17	*/
#define DIGITAL_PIN_10		PORT_1	/* P16	*/
#define DIGITAL_PIN_11		PORT_1	/* P13	*/
#define DIGITAL_PIN_12		PORT_1	/* P14	*/
#define DIGITAL_PIN_13		PORT_1	/* P15	*/
#define DIGITAL_PIN_14		PORT_6	/* P62	*/
#define DIGITAL_PIN_15		PORT_6	/* P63	*/
#define DIGITAL_PIN_16		PORT_7	/* P75	*/
#define DIGITAL_PIN_17		PORT_7	/* P74	*/
#define DIGITAL_PIN_18		PORT_7	/* P73	*/
#define DIGITAL_PIN_19		PORT_7	/* P72	*/
#define DIGITAL_PIN_20		PORT_7	/* P71	*/
#define DIGITAL_PIN_21		PORT_7	/* P70	*/
#define DIGITAL_PIN_22		PORT_5	/* P50	*/
#define DIGITAL_PIN_23		PORT_5	/* P51	*/
#define DIGITAL_PIN_24		PORT_1	/* P12	*/
#define DIGITAL_PIN_25		PORT_1	/* P11	*/
#define DIGITAL_PIN_26		PORT_2	/* P22	*/
#define DIGITAL_PIN_27		PORT_2	/* P21	*/
#define DIGITAL_PIN_28		PORT_13	/* P130	*/
#define DIGITAL_PIN_29		PORT_4	/* P40	*/
#define DIGITAL_PIN_30		PORT_12	/* P124 */
#define DIGITAL_PIN_31		PORT_12	/* P123	*/
#define DIGITAL_PIN_32		PORT_13	/* P137	*/
#define DIGITAL_PIN_33		PORT_12	/* P122	*/
#define DIGITAL_PIN_34		PORT_12	/* P121	*/
// 2022/11/14 modified by KAD
// P20, P60, P61
#define DIGITAL_PIN_35		PORT_2	/* P20	*/
#define DIGITAL_PIN_36		PORT_6	/* P60	*/
#define DIGITAL_PIN_37		PORT_6	/* P61	*/

