renesas/ArduinoCore-rl78g22_fpb/variants/g22-fpb-48p/pins_arduino.h
/* For A0-A5 */
#define DIGITAL_PIN_38		PORT_14	/* P147	*/
#define DIGITAL_PIN_39		PORT_2	/* P27	*/
#define DIGITAL_PIN_40		PORT_2	/* P26	*/
#define DIGITAL_PIN_41		PORT_2	/* P25	*/
#define DIGITAL_PIN_42		PORT_2	/* P24	*/
#define DIGITAL_PIN_43		PORT_2	/* P23	*/
// #define DIGITAL_PIN_44		PORT_2	/* P22	*/
// #define DIGITAL_PIN_45		PORT_12	/* P120	*/


/* Bit Num of digital pin define */
#define DIGITAL_PIN_BIT_0	0x01	/* P01	*/
#define DIGITAL_PIN_BIT_1	0x00	/* P00	*/
#define DIGITAL_PIN_BIT_2	0x00	/* P140	*/
#define DIGITAL_PIN_BIT_3	0x01	/* P31	*/
#define DIGITAL_PIN_BIT_4	0x00	/* P120	*/
#define DIGITAL_PIN_BIT_5	0x01	/* P41	*/
#define DIGITAL_PIN_BIT_6	0x00	/* P10	*/
#define DIGITAL_PIN_BIT_7	0x06	/* P146	*/
#define DIGITAL_PIN_BIT_8	0x00	/* P30	*/
#define DIGITAL_PIN_BIT_9	0x07	/* P17	*/
#define DIGITAL_PIN_BIT_10	0x06	/* P16	*/
#define DIGITAL_PIN_BIT_11	0x03	/* P13	*/
#define DIGITAL_PIN_BIT_12	0x04	/* P14	*/
#define DIGITAL_PIN_BIT_13	0x05	/* P15	*/
#define DIGITAL_PIN_BIT_14	0x02	/* P62	*/
#define DIGITAL_PIN_BIT_15	0x03	/* P63	*/
#define DIGITAL_PIN_BIT_16	0x05	/* P75	*/
#define DIGITAL_PIN_BIT_17	0x04	/* P74	*/
#define DIGITAL_PIN_BIT_18	0x03	/* P73	*/
#define DIGITAL_PIN_BIT_19	0x02	/* P72	*/
#define DIGITAL_PIN_BIT_20	0x01	/* P71	*/
#define DIGITAL_PIN_BIT_21	0x00	/* P70	*/
#define DIGITAL_PIN_BIT_22	0x00	/* P50	*/
#define DIGITAL_PIN_BIT_23	0x01	/* P51	*/
#define DIGITAL_PIN_BIT_24	0x02	/* P12	*/
#define DIGITAL_PIN_BIT_25	0x01	/* P11	*/
#define DIGITAL_PIN_BIT_26	0x02	/* P22	*/
#define DIGITAL_PIN_BIT_27	0x01	/* P21	*/
#define DIGITAL_PIN_BIT_28	0x00	/* P130	*/
#define DIGITAL_PIN_BIT_29	0x00	/* P40	*/
#define DIGITAL_PIN_BIT_30	0x04	/* P124	*/
#define DIGITAL_PIN_BIT_31	0x03	/* P123	*/
#define DIGITAL_PIN_BIT_32	0x07	/* P137	*/
#define DIGITAL_PIN_BIT_33	0x02	/* P122	*/
#define DIGITAL_PIN_BIT_34	0x01	/* P121	*/
// 2022/11/14 modified by KAD
#define DIGITAL_PIN_BIT_35	0x00	/* P20	*/
#define DIGITAL_PIN_BIT_36	0x00	/* P60	*/
#define DIGITAL_PIN_BIT_37	0x01	/* P61	*/

#define DIGITAL_PIN_BIT_38	0x07	/* P147	*/
#define DIGITAL_PIN_BIT_39	0x07	/* P27	*/
#define DIGITAL_PIN_BIT_40	0x06	/* P26	*/
#define DIGITAL_PIN_BIT_41	0x05	/* P25	*/
#define DIGITAL_PIN_BIT_42	0x04	/* P24	*/
#define DIGITAL_PIN_BIT_43	0x03	/* P23	*/
// #define DIGITAL_PIN_BIT_44	0x02	/* P22	*/
// #define DIGITAL_PIN_BIT_45	0x00	/* P120	*/

/* Bit mask of digital pin define. */
#define DIGITAL_PIN_MASK_0		0x02	/* P01	*/
#define DIGITAL_PIN_MASK_1		0x01	/* P00	*/
#define DIGITAL_PIN_MASK_2		0x01	/* P140	*/
#define DIGITAL_PIN_MASK_3		0x02	/* P31	*/
#define DIGITAL_PIN_MASK_4		0x01	/* P120	*/
#define DIGITAL_PIN_MASK_5		0x02	/* P41	*/
#define DIGITAL_PIN_MASK_6		0x01	/* P10	*/
#define DIGITAL_PIN_MASK_7		0x40	/* P146	*/
#define DIGITAL_PIN_MASK_8		0x01	/* P30	*/
#define DIGITAL_PIN_MASK_9		0x80	/* P17	*/
#define DIGITAL_PIN_MASK_10		0x40	/* P16	*/
#define DIGITAL_PIN_MASK_11		0x08	/* P13	*/
#define DIGITAL_PIN_MASK_12		0x10	/* P14	*/
#define DIGITAL_PIN_MASK_13		0x20	/* P15	*/
#define DIGITAL_PIN_MASK_14		0x04	/* P62	*/
#define DIGITAL_PIN_MASK_15		0x08	/* P63	*/
#define DIGITAL_PIN_MASK_16		0x20	/* P75	*/
#define DIGITAL_PIN_MASK_17		0x10	/* P74	*/
#define DIGITAL_PIN_MASK_18		0x08	/* P73	*/
#define DIGITAL_PIN_MASK_19		0x04	/* P72	*/
#define DIGITAL_PIN_MASK_20		0x02	/* P71	*/
#define DIGITAL_PIN_MASK_21		0x01	/* P70	*/
#define DIGITAL_PIN_MASK_22		0x20	/* P50	*/
#define DIGITAL_PIN_MASK_23		0x02	/* P51	*/
#define DIGITAL_PIN_MASK_24		0x04	/* P12	*/
#define DIGITAL_PIN_MASK_25		0x02	/* P11	*/
#define DIGITAL_PIN_MASK_26		0x04	/* P22	*/
#define DIGITAL_PIN_MASK_27		0x02	/* P21	*/
#define DIGITAL_PIN_MASK_28		0x01	/* P130	*/
#define DIGITAL_PIN_MASK_29		0x01	/* P40	*/
#define DIGITAL_PIN_MASK_30		0x10	/* P124	*/
#define DIGITAL_PIN_MASK_31		0x08	/* P123	*/
#define DIGITAL_PIN_MASK_32		0x80	/* P137	*/
#define DIGITAL_PIN_MASK_33		0x04	/* P122	*/
#define DIGITAL_PIN_MASK_34		0x02	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_MASK_35		0x01	/* P20	*/
#define DIGITAL_PIN_MASK_36		0x01	/* P60	*/
#define DIGITAL_PIN_MASK_37		0x02	/* P61	*/

#define DIGITAL_PIN_MASK_38		0x80 	/* P147	*/
#define DIGITAL_PIN_MASK_39		0x80	/* P27	*/
#define DIGITAL_PIN_MASK_40		0x40	/* P26	*/
#define DIGITAL_PIN_MASK_41		0x20	/* P25	*/
#define DIGITAL_PIN_MASK_42		0x10	/* P24	*/
#define DIGITAL_PIN_MASK_43		0x08	/* P23	*/
// #define DIGITAL_PIN_MASK_44		0x04	/* P22	*/
// #define DIGITAL_PIN_MASK_45		0x01	/* P120	*/

/* Add for G23 PMCA & PMCT & PMCE */
// these are only mask
// used at the pinmode in wiring_digital.c (*p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);)
// #define DIGITAL_PIN_PMCA_0		0x02	/* P01	*/
// #define DIGITAL_PIN_PMCA_1		0x01	/* P00	*/

#define DIGITAL_PIN_PMCA_0		0x00	/* P01	*/
#define DIGITAL_PIN_PMCA_1		0x00	/* P00	*/

#define DIGITAL_PIN_PMCA_2		0x00	/* P140	*/
#define DIGITAL_PIN_PMCA_3		0x00	/* P31	*/
#define DIGITAL_PIN_PMCA_4		0x01	/* P120	*/
#define DIGITAL_PIN_PMCA_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCA_6		0x00	/* P10	*/
#define DIGITAL_PIN_PMCA_7		0x00	/* P146	*/
#define DIGITAL_PIN_PMCA_8		0x00	/* P30	*/
#define DIGITAL_PIN_PMCA_9		0x00	/* P17	*/
#define DIGITAL_PIN_PMCA_10		0x00	/* P16	*/
#define DIGITAL_PIN_PMCA_11		0x00	/* P13	*/
#define DIGITAL_PIN_PMCA_12		0x00	/* P14	*/
#define DIGITAL_PIN_PMCA_13		0x00	/* P15	*/
#define DIGITAL_PIN_PMCA_14		0x00	/* P62	*/
#define DIGITAL_PIN_PMCA_15		0x00	/* P63	*/
#define DIGITAL_PIN_PMCA_16		0x00	/* P75	*/
#define DIGITAL_PIN_PMCA_17		0x00	/* P74	*/
#define DIGITAL_PIN_PMCA_18		0x00	/* P73	*/
#define DIGITAL_PIN_PMCA_19		0x00	/* P72	*/
#define DIGITAL_PIN_PMCA_20		0x00	/* P71	*/
#define DIGITAL_PIN_PMCA_21		0x00	/* P70	*/
#define DIGITAL_PIN_PMCA_22		0x00	/* P50	*/
#define DIGITAL_PIN_PMCA_23		0x00	/* P51	*/
#define DIGITAL_PIN_PMCA_24		0x00	/* P12	*/
#define DIGITAL_PIN_PMCA_25		0x00	/* P11	*/
#define DIGITAL_PIN_PMCA_26		0x04	/* P22	*/
#define DIGITAL_PIN_PMCA_27		0x02	/* P21	*/
#define DIGITAL_PIN_PMCA_28		0x00	/* P130	*/
#define DIGITAL_PIN_PMCA_29		0x00	/* P40	*/
#define DIGITAL_PIN_PMCA_30		0x00	/* P124	*/
#define DIGITAL_PIN_PMCA_31		0x00	/* P123	*/
#define DIGITAL_PIN_PMCA_32		0x00	/* P137	*/
#define DIGITAL_PIN_PMCA_33		0x00	/* P122	*/
#define DIGITAL_PIN_PMCA_34		0x00	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_PMCA_35		0x01	/* P20	*/
#define DIGITAL_PIN_PMCA_36		0x00	/* P60	*/
#define DIGITAL_PIN_PMCA_37		0x00	/* P61	*/

