renesas/ArduinoCore-rl78g22_fpb/variants/g22-fpb-48p/pins_arduino.h
#define DIGITAL_PIN_PMCA_38		0x80 	/* P147	*/
#define DIGITAL_PIN_PMCA_39		0x80	/* P27	*/
#define DIGITAL_PIN_PMCA_40		0x40	/* P26	*/
#define DIGITAL_PIN_PMCA_41		0x20	/* P25	*/
#define DIGITAL_PIN_PMCA_42		0x10	/* P24	*/
#define DIGITAL_PIN_PMCA_43		0x08	/* P23	*/
// #define DIGITAL_PIN_PMCA_44		0x04	/* P22	*/
// #define DIGITAL_PIN_PMCA_45		0x00	/* P120	*/

#define DIGITAL_PIN_PMCT_0		0x02	/* P01	*/
#define DIGITAL_PIN_PMCT_1		0x01	/* P00	*/
#define DIGITAL_PIN_PMCT_2		0x01	/* P140	*/
#define DIGITAL_PIN_PMCT_3		0x02	/* P31	*/
#define DIGITAL_PIN_PMCT_4		0x00	/* P120	*/
#define DIGITAL_PIN_PMCT_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCT_6		0x01	/* P10	*/
#define DIGITAL_PIN_PMCT_7		0x40	/* P146	*/
#define DIGITAL_PIN_PMCT_8		0x01	/* P30	*/
#define DIGITAL_PIN_PMCT_9		0x80	/* P17	*/
#define DIGITAL_PIN_PMCT_10 	0x40	/* P16	*/
#define DIGITAL_PIN_PMCT_11 	0x08	/* P13	*/
#define DIGITAL_PIN_PMCT_12 	0x10	/* P14	*/
#define DIGITAL_PIN_PMCT_13 	0x20	/* P15	*/
#define DIGITAL_PIN_PMCT_14 	0x00	/* P62	*/
#define DIGITAL_PIN_PMCT_15 	0x00	/* P63	*/
#define DIGITAL_PIN_PMCT_16 	0x20	/* P75	*/
#define DIGITAL_PIN_PMCT_17 	0x10	/* P74	*/
#define DIGITAL_PIN_PMCT_18 	0x08	/* P73	*/
#define DIGITAL_PIN_PMCT_19 	0x04	/* P72	*/
#define DIGITAL_PIN_PMCT_20 	0x02	/* P71	*/
#define DIGITAL_PIN_PMCT_21 	0x01	/* P70	*/
#define DIGITAL_PIN_PMCT_22 	0x20	/* P50	*/
#define DIGITAL_PIN_PMCT_23 	0x02	/* P51	*/
#define DIGITAL_PIN_PMCT_24 	0x04	/* P12	*/
#define DIGITAL_PIN_PMCT_25 	0x02	/* P11	*/
#define DIGITAL_PIN_PMCT_26 	0x04	/* P22	*/
#define DIGITAL_PIN_PMCT_27 	0x02	/* P21	*/
#define DIGITAL_PIN_PMCT_28 	0x01	/* P130	*/
#define DIGITAL_PIN_PMCT_29 	0x00	/* P40	*/
#define DIGITAL_PIN_PMCT_30 	0x00	/* P124	*/
#define DIGITAL_PIN_PMCT_31 	0x00	/* P123	*/
#define DIGITAL_PIN_PMCT_32 	0x80	/* P137	*/
#define DIGITAL_PIN_PMCT_33 	0x00	/* P122	*/
#define DIGITAL_PIN_PMCT_34 	0x02	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_PMCT_35		0x01	/* P20	*/
#define DIGITAL_PIN_PMCT_36		0x01	/* P60	*/
#define DIGITAL_PIN_PMCT_37		0x02	/* P61	*/

#define DIGITAL_PIN_PMCT_38 	0x80 	/* P147	*/
#define DIGITAL_PIN_PMCT_39 	0x80	/* P27	*/
#define DIGITAL_PIN_PMCT_40 	0x40	/* P26	*/
#define DIGITAL_PIN_PMCT_41 	0x20	/* P25	*/
#define DIGITAL_PIN_PMCT_42 	0x10	/* P24	*/
#define DIGITAL_PIN_PMCT_43 	0x08	/* P23	*/
// #define DIGITAL_PIN_PMCT_44 	0x04	/* P22	*/
// #define DIGITAL_PIN_PMCT_45 	0x01	/* P120	*/

/* Define Digital Pin PM */
// used for (if (0 != p->pm){)
#define DIGITAL_PIN_PM_0		0x02	/* P01	*/
#define DIGITAL_PIN_PM_1		0x01	/* P00	*/
#define DIGITAL_PIN_PM_2		0x01	/* P140	*/
#define DIGITAL_PIN_PM_3		0x02	/* P31	*/
#define DIGITAL_PIN_PM_4		0x01	/* P120	*/
#define DIGITAL_PIN_PM_5		0x02	/* P41	*/
#define DIGITAL_PIN_PM_6		0x01	/* P10	*/
#define DIGITAL_PIN_PM_7		0x40	/* P146	*/
#define DIGITAL_PIN_PM_8		0x01	/* P30	*/
#define DIGITAL_PIN_PM_9		0x80	/* P17	*/
#define DIGITAL_PIN_PM_10		0x40	/* P16	*/
#define DIGITAL_PIN_PM_11		0x08	/* P13	*/
#define DIGITAL_PIN_PM_12		0x10	/* P14	*/
#define DIGITAL_PIN_PM_13		0x20	/* P15	*/
#define DIGITAL_PIN_PM_14		0x04	/* P62	*/
#define DIGITAL_PIN_PM_15		0x08	/* P63	*/
#define DIGITAL_PIN_PM_16		0x20	/* P75	*/
#define DIGITAL_PIN_PM_17		0x10	/* P74	*/
#define DIGITAL_PIN_PM_18		0x08	/* P73	*/
#define DIGITAL_PIN_PM_19		0x04	/* P72	*/
#define DIGITAL_PIN_PM_20		0x02	/* P71	*/
#define DIGITAL_PIN_PM_21		0x01	/* P70	*/
#define DIGITAL_PIN_PM_22		0x20	/* P50	*/
#define DIGITAL_PIN_PM_23		0x02	/* P51	*/
#define DIGITAL_PIN_PM_24		0x04	/* P12	*/
#define DIGITAL_PIN_PM_25		0x02	/* P11	*/
#define DIGITAL_PIN_PM_26		0x04	/* P22	*/
#define DIGITAL_PIN_PM_27		0x02	/* P21	*/
#define DIGITAL_PIN_PM_28		0x00	/* P130	*/
#define DIGITAL_PIN_PM_29		0x01	/* P40	*/
#define DIGITAL_PIN_PM_30		0x00	/* P124	*/
#define DIGITAL_PIN_PM_31		0x00	/* P123	*/
#define DIGITAL_PIN_PM_32		0x00	/* P137	*/
#define DIGITAL_PIN_PM_33		0x04	/* P122	*/
#define DIGITAL_PIN_PM_34		0x02	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_PM_35		0x01	/* P20	*/
#define DIGITAL_PIN_PM_36		0x01	/* P60	*/
#define DIGITAL_PIN_PM_37		0x02	/* P61	*/

#define DIGITAL_PIN_PM_38		0x80 	/* P147	*/
#define DIGITAL_PIN_PM_39		0x80	/* P27	*/
#define DIGITAL_PIN_PM_40		0x40	/* P26	*/
#define DIGITAL_PIN_PM_41		0x20	/* P25	*/
#define DIGITAL_PIN_PM_42		0x10	/* P24	*/
#define DIGITAL_PIN_PM_43		0x08	/* P23	*/
// #define DIGITAL_PIN_PM_44		0x04	/* P22	*/
// #define DIGITAL_PIN_PM_45		0x00	/* P120	*/

/* Define Digital Pin PU */
#define DIGITAL_PIN_PU_0		0x02	/* P01	*/
#define DIGITAL_PIN_PU_1		0x01	/* P00	*/
#define DIGITAL_PIN_PU_2		0x01	/* P140	*/
#define DIGITAL_PIN_PU_3		0x02	/* P31	*/
#define DIGITAL_PIN_PU_4		0x01	/* P120	*/
#define DIGITAL_PIN_PU_5		0x02	/* P41	*/
#define DIGITAL_PIN_PU_6		0x01	/* P10	*/
#define DIGITAL_PIN_PU_7		0x40	/* P146	*/
#define DIGITAL_PIN_PU_8		0x01	/* P30	*/
#define DIGITAL_PIN_PU_9		0x80	/* P17	*/
#define DIGITAL_PIN_PU_10		0x40	/* P16	*/
#define DIGITAL_PIN_PU_11		0x08	/* P13	*/
#define DIGITAL_PIN_PU_12		0x10	/* P14	*/
#define DIGITAL_PIN_PU_13		0x20	/* P15	*/
#define DIGITAL_PIN_PU_14		0x00	/* P62	*/
#define DIGITAL_PIN_PU_15		0x00	/* P63	*/
#define DIGITAL_PIN_PU_16		0x20	/* P75	*/
#define DIGITAL_PIN_PU_17		0x10	/* P74	*/
#define DIGITAL_PIN_PU_18		0x08	/* P73	*/
#define DIGITAL_PIN_PU_19		0x04	/* P72	*/
#define DIGITAL_PIN_PU_20		0x02	/* P71	*/
#define DIGITAL_PIN_PU_21		0x01	/* P70	*/
#define DIGITAL_PIN_PU_22		0x20	/* P50	*/
#define DIGITAL_PIN_PU_23		0x02	/* P51	*/
#define DIGITAL_PIN_PU_24		0x04	/* P12	*/
#define DIGITAL_PIN_PU_25		0x02	/* P11	*/
#define DIGITAL_PIN_PU_26		0x00	/* P22	*/
#define DIGITAL_PIN_PU_27		0x00	/* P21	*/
#define DIGITAL_PIN_PU_28		0x00	/* P130	*/
#define DIGITAL_PIN_PU_29		0x01	/* P40	*/
#define DIGITAL_PIN_PU_30		0x00	/* P124	*/
#define DIGITAL_PIN_PU_31		0x00	/* P123	*/
#define DIGITAL_PIN_PU_32		0x00	/* P137	*/
#define DIGITAL_PIN_PU_33		0x04	/* P122	*/
#define DIGITAL_PIN_PU_34		0x02	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_PU_35		0x01	/* P20	*/
#define DIGITAL_PIN_PU_36		0x01	/* P60	*/
#define DIGITAL_PIN_PU_37		0x02	/* P61	*/

