renesas/ArduinoCore-rl78g22_fpb/variants/g22-fpb-48p/pins_arduino.h
#define DIGITAL_PIN_PU_38		0x80 	/* P147	*/
#define DIGITAL_PIN_PU_39		0x00	/* P27	*/
#define DIGITAL_PIN_PU_40		0x00	/* P26	*/
#define DIGITAL_PIN_PU_41		0x00	/* P25	*/
#define DIGITAL_PIN_PU_42		0x00	/* P24	*/
#define DIGITAL_PIN_PU_43		0x00	/* P23	*/
// #define DIGITAL_PIN_PU_44		0x00	/* P22	*/
// #define DIGITAL_PIN_PU_45		0x01	/* P120	*/

/* Define Digital Pin PIM */
#define DIGITAL_PIN_PIM_0		0x02	/* P01	*/
#define DIGITAL_PIN_PIM_1		0x00	/* P00	*/
#define DIGITAL_PIN_PIM_2		0x00	/* P140	*/
#define DIGITAL_PIN_PIM_3		0x00	/* P31	*/
#define DIGITAL_PIN_PIM_4		0x00	/* P120	*/
#define DIGITAL_PIN_PIM_5		0x02	/* P41	*/
#define DIGITAL_PIN_PIM_6		0x01	/* P10	*/
#define DIGITAL_PIN_PIM_7		0x00	/* P146	*/
#define DIGITAL_PIN_PIM_8		0x00	/* P30	*/
#define DIGITAL_PIN_PIM_9		0x80	/* P17	*/
#define DIGITAL_PIN_PIM_10		0x40	/* P16	*/
#define DIGITAL_PIN_PIM_11		0x08	/* P13	*/
#define DIGITAL_PIN_PIM_12		0x10	/* P14	*/
#define DIGITAL_PIN_PIM_13		0x20	/* P15	*/
#define DIGITAL_PIN_PIM_14		0x00	/* P62	*/
#define DIGITAL_PIN_PIM_15		0x00	/* P63	*/
#define DIGITAL_PIN_PIM_16		0x00	/* P75	*/
#define DIGITAL_PIN_PIM_17		0x00	/* P74	*/
#define DIGITAL_PIN_PIM_18		0x00	/* P73	*/
#define DIGITAL_PIN_PIM_19		0x00	/* P72	*/
#define DIGITAL_PIN_PIM_20		0x00	/* P71	*/
#define DIGITAL_PIN_PIM_21		0x00	/* P70	*/
#define DIGITAL_PIN_PIM_22		0x00	/* P50	*/
#define DIGITAL_PIN_PIM_23		0x00	/* P51	*/
#define DIGITAL_PIN_PIM_24		0x00	/* P12	*/
#define DIGITAL_PIN_PIM_25		0x02	/* P11	*/
#define DIGITAL_PIN_PIM_26		0x00	/* P22	*/
#define DIGITAL_PIN_PIM_27		0x00	/* P21	*/
#define DIGITAL_PIN_PIM_28		0x00	/* P130	*/
#define DIGITAL_PIN_PIM_29		0x00	/* P40	*/
#define DIGITAL_PIN_PIM_30		0x00	/* P124	*/
#define DIGITAL_PIN_PIM_31		0x00	/* P123	*/
#define DIGITAL_PIN_PIM_32		0x00	/* P137	*/
#define DIGITAL_PIN_PIM_33		0x00	/* P122	*/
#define DIGITAL_PIN_PIM_34		0x00	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_PIM_35		0x01	/* P20	*/
#define DIGITAL_PIN_PIM_36		0x00	/* P60	*/
#define DIGITAL_PIN_PIM_37		0x00	/* P61	*/

#define DIGITAL_PIN_PIM_38		0x00 	/* P147	*/
#define DIGITAL_PIN_PIM_39		0x00	/* P27	*/
#define DIGITAL_PIN_PIM_40		0x00	/* P26	*/
#define DIGITAL_PIN_PIM_41		0x00	/* P25	*/
#define DIGITAL_PIN_PIM_42		0x00	/* P24	*/
#define DIGITAL_PIN_PIM_43		0x00	/* P23	*/
// #define DIGITAL_PIN_PIM_44		0x00	/* P22	*/
// #define DIGITAL_PIN_PIM_45		0x00	/* P120	*/

/* Define Digital Pin POM */
#define DIGITAL_PIN_POM_0		0x01	/* P01	*/
#define DIGITAL_PIN_POM_1		0x00	/* P00	*/
#define DIGITAL_PIN_POM_2		0x00	/* P140	*/
#define DIGITAL_PIN_POM_3		0x00	/* P31	*/
#define DIGITAL_PIN_POM_4		0x01	/* P120	*/
#define DIGITAL_PIN_POM_5		0x00	/* P41	*/
#define DIGITAL_PIN_POM_6		0x01	/* P10	*/
#define DIGITAL_PIN_POM_7		0x00	/* P146	*/
#define DIGITAL_PIN_POM_8		0x00	/* P30	*/
#define DIGITAL_PIN_POM_9		0x80	/* P17	*/
#define DIGITAL_PIN_POM_10		0x00	/* P16	*/
#define DIGITAL_PIN_POM_11		0x08	/* P13	*/
#define DIGITAL_PIN_POM_12		0x10	/* P14	*/
#define DIGITAL_PIN_POM_13		0x20	/* P15	*/
#define DIGITAL_PIN_POM_14		0x00	/* P62	*/
#define DIGITAL_PIN_POM_15		0x00	/* P63	*/
#define DIGITAL_PIN_POM_16		0x00	/* P75	*/
#define DIGITAL_PIN_POM_17		0x10	/* P74	*/
#define DIGITAL_PIN_POM_18		0x00	/* P73	*/
#define DIGITAL_PIN_POM_19		0x04	/* P72	*/
#define DIGITAL_PIN_POM_20		0x02	/* P71	*/
#define DIGITAL_PIN_POM_21		0x00	/* P70	*/
#define DIGITAL_PIN_POM_22		0x20	/* P50	*/
#define DIGITAL_PIN_POM_23		0x00	/* P51	*/
#define DIGITAL_PIN_POM_24		0x04	/* P12	*/
#define DIGITAL_PIN_POM_25		0x02	/* P11	*/
#define DIGITAL_PIN_POM_26		0x00	/* P22	*/
#define DIGITAL_PIN_POM_27		0x00	/* P21	*/
#define DIGITAL_PIN_POM_28		0x00	/* P130	*/
#define DIGITAL_PIN_POM_29		0x00	/* P40	*/
#define DIGITAL_PIN_POM_30		0x00	/* P124	*/
#define DIGITAL_PIN_POM_31		0x00	/* P123	*/
#define DIGITAL_PIN_POM_32		0x00	/* P137	*/
#define DIGITAL_PIN_POM_33		0x00	/* P122	*/
#define DIGITAL_PIN_POM_34		0x00	/* P121	*/

// 2022/11/14 modified by KAD
#define DIGITAL_PIN_POM_35		0x00	/* P20	*/
#define DIGITAL_PIN_POM_36		0x00	/* P60	*/
#define DIGITAL_PIN_POM_37		0x00	/* P61	*/

#define DIGITAL_PIN_POM_38		0x00 	/* P147	*/
#define DIGITAL_PIN_POM_39		0x00	/* P27	*/
#define DIGITAL_PIN_POM_40		0x00	/* P26	*/
#define DIGITAL_PIN_POM_41		0x00	/* P25	*/
#define DIGITAL_PIN_POM_42		0x00	/* P24	*/
#define DIGITAL_PIN_POM_43		0x00	/* P23	*/
// #define DIGITAL_PIN_POM_44		0x00	/* P22	*/
// #define DIGITAL_PIN_POM_45		0x00	/* P120	*/

// end 2022/10/24

// #define PWM_PIN_11			0xE0	// Software PWM0
// #define PWM_PIN_22			0xE1	// Software PWM1
//#define PWM_PIN_23			0xE2	// Software PWM2
// #define PWM_PIN_24			0xE3	// Software PWM3

#define SWPWM_PIN			0xE0
/* 1006 Nhu add */
#define PWM_PIN_3			3		// TO4
#define PWM_PIN_6			6		// TO7
#define PWM_PIN_12			12		// TO3
#define PWM_PIN_25			25		// TO6
#define PWM_PIN_24			24		// TO5
#define PWM_PIN_9			9		// TO2
#define PWM_PIN_10			10		// TO1
// 2022/11/15 added by KAD
#define PWM_PIN_5			5		// TO7
/* 1006 Nhu add */
/* Define Serial Port Number */
#define SERIAL_TXD0			24 // P12
#define SERIAL_RXD0			25 // P11

#define SERIAL_TXD1			1  // P00
#define SERIAL_RXD1			0  // P01

#define SERIAL_TXD2			11 // P13
#define SERIAL_RXD2			12 // P14
/* Define Serial Port Number */

/* Define Firmata library */
#define TOTAL_ANALOG_PINS       NUM_ANALOG_INPUTS //6
#define TOTAL_PINS              NUM_DIGITAL_PINS // 14 digital + 6 analog + 6 reserved + 10 internal used + 2 I2C + 3 SPI
#define TOTAL_PORTS             15 //P00 - P147
#define VERSION_BLINK_PIN       BUILTIN_LED1
#define PIN_SERIAL0_RX          25
#define PIN_SERIAL0_TX          24
#define PIN_SERIAL1_RX          0
#define PIN_SERIAL1_TX          1
#define PIN_SERIAL2_RX          12
#define PIN_SERIAL2_TX          11
#define IS_PIN_DIGITAL(p)       ((p) >= 0 && (p) < NUM_DIGITAL_PINS && ((p) != PIN_SERIAL0_RX) && ((p) != PIN_SERIAL0_TX) && ((p) != PIN_SERIAL1_RX) && ((p) != PIN_SERIAL1_TX))
#define IS_PIN_ANALOG(p)        ((p) >= 51 && (p) < 57)
#define IS_PIN_PWM(p)           digitalPinHasPWM(p)
#define IS_PIN_SERVO(p)         ((p) >= 0 && (p) < MAX_SERVOS)
#define IS_PIN_I2C(p)           ((p) == 47 || (p) == 48 || (p) == 49 || (p) == 50)
#define IS_PIN_SPI(p)           ((p) == SS || (p) == MOSI || (p) == MISO || (p) == SCK)
#define IS_PIN_SERIAL(p)        ((p) == PIN_SERIAL0_RX || (p) == PIN_SERIAL0_TX || (p) == PIN_SERIAL1_RX || (p) == PIN_SERIAL1_TX || (p) == PIN_SERIAL2_RX || (p) == PIN_SERIAL2_TX)
#define PIN_TO_DIGITAL(p)       (p)
#define PIN_TO_ANALOG(p)        ((p) - 14)
#define PIN_TO_PWM(p)           PIN_TO_DIGITAL(p)
#define PIN_TO_SERVO(p)         (p)
#define ANALOG_TO_PIN(p)        ((p) + 51)
/* Define Firmata library */

#ifdef ARDUINO_MAIN

// On the Arduino board, digital pins are also used
// for the analog output (software PWM).  Analog input
// pins are a separate set.

